micronaut-benchmark-app/benchmark-tests/ab-100-concurrent-delay-100
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=100
Document Length:        26 bytes

Concurrency Level:      100
Time taken for tests:   4.414 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      152000 bytes
HTML transferred:       26000 bytes
Requests per second:    226.57 [#/sec] (mean)
Time per request:       441.363 [ms] (mean)
Time per request:       4.414 [ms] (mean, across all concurrent requests)
Transfer rate:          33.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.1      2       6
Processing:   104  409  71.0    408     524
Waiting:      102  408  70.9    408     520
Total:        107  411  70.4    410     525

Percentage of the requests served within a certain time (ms)
  50%    410
  66%    413
  75%    417
  80%    423
  90%    506
  95%    510
  98%    515
  99%    517
 100%    525 (longest request)