micronaut-benchmark-app/benchmark-tests/ab-100-concurrent-delay-500
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=500
Document Length:        26 bytes

Concurrency Level:      100
Time taken for tests:   22.079 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      152000 bytes
HTML transferred:       26000 bytes
Requests per second:    45.29 [#/sec] (mean)
Time per request:       2207.877 [ms] (mean)
Time per request:       22.079 [ms] (mean, across all concurrent requests)
Transfer rate:          6.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.4      1       8
Processing:   505 2053 308.8   2019    2909
Waiting:      505 2052 308.8   2018    2909
Total:        511 2054 307.9   2019    2911

Percentage of the requests served within a certain time (ms)
  50%   2019
  66%   2039
  75%   2057
  80%   2398
  90%   2482
  95%   2511
  98%   2519
  99%   2522
 100%   2911 (longest request)