micronaut-benchmark-app/benchmark-tests/ab-500-concurrent-delay-100
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=100
Document Length:        26 bytes

Concurrency Level:      500
Time taken for tests:   21.553 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      760000 bytes
HTML transferred:       130000 bytes
Requests per second:    231.98 [#/sec] (mean)
Time per request:       2155.316 [ms] (mean)
Time per request:       4.311 [ms] (mean, across all concurrent requests)
Transfer rate:          34.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   5.5      2      31
Processing:   102 2026 362.7   2128    2383
Waiting:      102 2025 362.9   2127    2383
Total:        133 2030 357.5   2130    2386

Percentage of the requests served within a certain time (ms)
  50%   2130
  66%   2146
  75%   2152
  80%   2159
  90%   2173
  95%   2179
  98%   2199
  99%   2216
 100%   2386 (longest request)